УТ_для_edt/src/Catalogs/смартСтатусыRoistat/смартСтатусыRoistat.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартСтатусыRoistat</name>
  <comment>#Б-1538 смарт: Лопато 05.12.2024 //Интеграция с ROIStat. Добавить справочник Статусы ROIStat, доработать регистр состояний Интересов</comment>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.смартТипыСтатусовRoistat</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СостоянияИнтересовИУсловия</name>
    <attributes>
      <name>СостояниеИнтереса</name>
      <type>
        <types>CatalogRef.CRM_СостоянияИнтересов</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтрольОплаты</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПолнаяОплата</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/смартСтатусыRoistat/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПроверитьЗаполнениеТабличнойЧастиУсловий(Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеТабличнойЧастиУсловий(Отказ)

	НомераСтрокСДублями = "";
	
	Для Каждого СтрокаУсловий Из Объект.СостоянияИнтересовИУсловия Цикл

		СтруктураОтбора = Новый Структура("СостояниеИнтереса, КонтрольОплаты, ПолнаяОплата");
		
		ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтрокаУсловий);
		
		НайденныеСтроки = Объект.СостоянияИнтересовИУсловия.НайтиСтроки(СтруктураОтбора);
		
		Если НайденныеСтроки.Количество() > 1 Тогда
			НомераСтрокСДублями = НомераСтрокСДублями + СтрокаУсловий.НомерСтроки + ", ";
		КонецЕсли;	

	КонецЦикла;	

	Если ЗначениеЗаполнено(НомераСтрокСДублями) Тогда
		
		ТекстСообщения = НСтр("ru = 'Запись невозможна, неуникальные значения в таблице состояний и условий в строках: '") 
						 + Лев(НомераСтрокСДублями, СтрДлина(НомераСтрокСДублями) - 1);

		ОбщегоНазначения.СообщитьПользователю(
			ТекстСообщения,, "СостоянияИнтересовИУсловия", "Объект.СостоянияИнтересовИУсловия", Отказ);
		
	КонецЕсли;	
	
КонецПроцедуры
